{"id": "abbreviation-notes-new.pptx::chunk1", "source_rel": "abbreviation-notes-new.pptx", "type": "pptx", "text": "[Slide 1]\nAbbreviations\nABBREVIATION | CONCEPT\nREQ | REQUEST\nSW | SPOKE WITH\nOTP | ON THE PHONE\nGST | GUEST\nRES SP | RESERVATION SPECIALIST\nMNGT | MANAGEMENT\nVC | VIRTUAL CARD\nCC | CREDIT CARD\nZD | ZENDESK\nMOD | MANAGER ON DUTY\nLVM | LEFT VOICE MAIL\nHTL | HOTEL/MOTEL\nVM | VOICE MAIL\nRP | RATE PROVIDER\nFD | FRONT DESK\nEM | E-MAIL\nEM'D | E-MAILED\nNR | NEW REFUND\nCXL | CANCEL\nCXL# | CANCELATION #\nFOC | FREE OF CHARGES\nGM | GENERAL MANAGER\nRSV | RESERVATION\nIT# | ITINERARY NUMBER"}
{"id": "call-aheads-overview-3.pptx::chunk1", "source_rel": "call-aheads-overview-3.pptx", "type": "pptx", "text": "[Slide 1]\nCall Ahead Overview\nOpen the call ahead queue and review the reservations that are available. Access the queue by selecting Pre-CheckIn Calls in the Menu Bar. This will bring up the reservations available to call ahead.\nThe visible lock next to the hotel ID indicates that a fellow agents is currently viewing that reservation.\n\n[Slide 2]\nCall Ahead Overview\nSelect a hotel that does not have the lock on it, and it will display how many reservations you need to confirm that property\n\n[Slide 3]\nCall Ahead Overview\nClick on the phone number to contact the hotel. If the phone number does not connect you to the hotel, you can highlight the hotel information and Right Click to do a Search for the phone number.\nGenerally, you will always speak to the “front desk” and not a different department.\nGreet the front desk staff member and indicate you are calling on behalf of HotelPlanner\nAsk the hotel to look up the reservation by the guest's name and ask them if they have it confirmed.\nOnce the front desk confirms they have the booking request the following details:\nAsk the hotel for their internal confirmation number for check in\nConfirm the hotel sees the virtual card for payment - Except for “pay at hotel”\nAdvise the hotel this is a prepaid reservation and to make a note that the guest does not receive a copy of the receipt from the hotel but that we will be sending it to their phone."}
{"id": "call-aheads-overview-3.pptx::chunk2", "source_rel": "call-aheads-overview-3.pptx", "type": "pptx", "text": "[Slide 4]\nCall Ahead Overview\nOnce the front desk agent finds the reservation:\nThank you, and just to confirm you have a room with (#number of beds), the customer also requested ( if the customer has a special request) are you able to honor it? And can I please have the hotel’s confirmation number to put on my notes? If the reservation is prepaid, confirm that the hotel has the payment and the client should not receive a receipt from the hotel but that we would be sending it via email and text.\nIf the front desk agent does not find the reservation:\nCan you please check your cancellations? The supplier on this reservation is ( see who is the supplier and let the hotel know to see if they can find it that way) if the hotel doesn’t find it then add the notes, thank the front desk agent, and disconnect the call.\n\n[Slide 5]\nCall Ahead Overview\nIf the hotel doesn’t have the reservation, doesn't have payment, the room is different or has any errors, select the booking error that applies and add notes explaining what the issue is with the booking.\nBooking Not Found\nNo Payment Found\nCustomer Cancelled\nDifferent Room Type\nSpecial Request Not Available\nPlease DO NOT use the following selections unless the hotel will no longer be taking bookings, as it will move future bookings to our relocations queue:\nMapping\nHotel Closure\nBooking Refused"}
{"id": "cancellation-of-reservations-dec.pptx::chunk1", "source_rel": "cancellation-of-reservations-dec.pptx", "type": "pptx", "text": "[Slide 1]\nCANCELLATION\n\n[Slide 2]\n•Reduce and Eliminate Expenses\nWhy do people cancel their reservation?\n•Change of Plan\n•Decide on a Different Location\n\n[Slide 3]\n“Thank you for calling Hotel Reservation. This is ____. How can I help you today?”\n“I'm sorry to hear that you wanted to cancel your reservation.\n”May I know what's your name so I can address you properly?”\n“May I have your itinerary number please?For security purposes, what is the name on the reservation? What are the dates of check-in and check-out?What is the name of the hotel ?Thank you for verifying this information”\n“May I know the reason for the cancellation?”\n“One moment while I check the cancellation policy of the reservation.”\n\n[Slide 4]\nREFUNDABLE / WITHIN CANCELLATION POLICY\n\n[Slide 5]\nCANCEL ON NON-REFUNDABLE/REFUNDABLE WITH PENALTY\n\n[Slide 6]\nREFUND PROTECTION Covered REASONS\n\n[Slide 7]\nREASONS TO CALL THE HOTEL ON CANCELLATIONS\nPay at the hotel\nIf reservation is cancellable but shows a penalty, we will call the hotel to obtain a waiver.\nIf reservation is non-refundable , we will ALWAYS call the hotel to obtain a waiver.\nIf reservation is covered by Protecht, we will call the hotel to obtain a waiver.\nDO NOT SHARE HOTEL APPROVAL/DENIAL WITH THE GUEST, PLACE DECISION IN THE NOTES\nREASONS TO PRESS THE CANCEL BUTTON\nGuest wants to cancel\nGuest suggests agent error\nGuest has Protecht insurance and has requested to cancel"}
{"id": "cancellation-of-reservations-dec.pptx::chunk2", "source_rel": "cancellation-of-reservations-dec.pptx", "type": "pptx", "text": "[Slide 8]\nWhat to obtain at the HOTEL?\n•If the hotel has agreed to a full refund on a penalized or non-refundable booking, ask for cancellation number, folio, front desk name and position.\n•If the hotel says they cannot provide a folio or that the folio is blank simply advise the hotel to send an email to Folio@hotelplanner.com\n•Please ask that the email includes; Guest first and last name, and the message “this reservation was cancelled free of charge/ without penalty“.\n\n[Slide 9]\nBILLING AND REFUND TICKET\n“We will be raising a ticket for our Tickets Team to review your concern. They will be reaching out to you as soon as possible through your email. May I confirm your email address. Is it _________?”\n\n[Slide 10]\n•For some scenarios the guest insists on having the refund immediately, advise the guest that “We will escalate your request (follow escalation matrix). We advise that it may take 2-10 business days depending on your bank.”\n•For some scenarios that guest insists on having the voucher immediately (Check the FIT to see if voucher was issued). Immediate voucher requests should only be made for same-day re-bookings where hotel denied lodging or agent error. For same day check-in re-book the guest in a new transaction. (Recommended Pay at Hotel) For guests that will not be checking in on the same day but need to make their next reservation, offer to re-book immediately in a new transaction."}
{"id": "charges-disputes-dec.pptx::chunk1", "source_rel": "charges-disputes-dec.pptx", "type": "pptx", "text": "[Slide 1]\nDisputed Reservations\nDisputes:\nOnce a dispute has been opened on a reservation, we are unable to issue any refund until the dispute has been closed. Closure of a dispute takes up to 90 days, but the guest is able to provide written documentation of the closure of the dispute in order to move on to grant a possible refund. This is subject to the merchant approval as well.\nOur ispute team will then work with our merchant to get the dispute removed from the booking so that the Escalations Team can work on obtaining authorization for any pending refund.\nRequests for status updates on disputed reservations can also be sent to this email – chargereview@hotelplanner.com\n\n[Slide 2]\nHow to proceed for Unrecognized Charges\nIf you CAN ﬁnd the RSV:\nResend a copy of the confirmation via email and text.\nIf you CANNOT ﬁnd the RSV:\nIf a Client receives a charge that they do not recognize and you’re unable to pull up a RSV with the information provided, ask them to email Proof of Charge (could be a screenshot of the charges on their CC Statement) to: reservations@hotelplanner.com"}
{"id": "charges-disputes-dec.pptx::chunk2", "source_rel": "charges-disputes-dec.pptx", "type": "pptx", "text": "[Slide 3]\nCharges without a RSV\nIf a client calls because they were trying to make a booking, and they got charged but the reservation wasn’t completed successfully, you’ll need to advise the client that if the charge is still Pending it will disappear in the next 24 - 48 hours. If the charge is Posted after the 48 hours, they will need to send a copy of the charge or bank statement to reservations@hotelplanner.com.\nIf at the time of the call, the charge has posted out of their account, they need to send it right away to the same email. Please ask the guest to kindly add a brief explanation of what happened and the screenshot of the charges.\n\n[Slide 4]\nUnrecognized RSVs\nSometimes, you’ll receive a call from a Client that received a text message notiﬁcation conﬁrming a RSV. Whenever this happens, validate the information on the RSV and conﬁrm with the Guest if they receive a charge to their CC related to that RSV.\nIf the Client has been charged for it, and the email on the RSV does not belong to them, you can ask them to submit the screenshot of the charges to our reservations@hotelplanner.com email adding the details of the RSV to easily identify it.\nIf the Guet hasn’t been charged, verify the phone number in our RSV is the same as the guests. Advise them the information received was sent in error to their phone number ."}
{"id": "charges-disputes-dec.pptx::chunk3", "source_rel": "charges-disputes-dec.pptx", "type": "pptx", "text": "[Slide 5]\nDuplicate Charges\nSometimes, you’ll receive a call from a Guest that has been charged multiple times for the same reservations or the hotel has charged the guest a second time for a prepaid reservation. When this happens, please request a screenshot of both charges to be replied to the ticket that will be created by using the “Double Charge” dropdown."}
{"id": "copy-of-qa-groups-ver-1-2.xlsx::chunk1", "source_rel": "copy-of-qa-groups-ver-1-2.xlsx", "type": "xlsx", "text": ""}
{"id": "copy-of-qa-groups-ver-1-2.xlsx::chunk2", "source_rel": "copy-of-qa-groups-ver-1-2.xlsx", "type": "xlsx", "text": "[Sheet: Original QA]\nHP Client form\nHotel Planner | Service Assessment | # | % | Criteria | Guideline | Hotel Planner | Groups Assessment | Poss Score | Actual Score | Criteria | Guideline\n1.1 | Must be available and ready to take incoming call. | 3 | #REF! | Yes | Agent must answer the call immediately avoiding that the guest has to speak first. | Agent is ready to receive call | 4 | Yes | Agent begins speaking within 3-5 seconds of being connected to the call. Meaning: Once dial tune has ended if present.\nNo | Guest speaks first, either greeting or making a request. | 1.1 | No | No- if agent took more than 3 seconds to answer, OR begins prior to dial tune ending.\nN/A | System issues (hardware or software), as long as it is not a recurrent condition. | N/A | System issues (hardware or software), as long as it is not a recurrent condition. No need to Q/A an N/A!\n1.2 | Must open the call with correct introduction. | 2 | #REF! | Yes | Agent correctly opens the call by saying \"Thank you for calling Hotel Reservations\", using the same name or english alias in all calls. I.E. Ricardo = Richard | 2.1 | Must open the conversation with correct introduction. | 6 | Yes | Agent answers using, \"Thank you for calling Hotel Reservations. My name is___________________, how may I assist you?\"\nNo | -Agent does not provide correct introduction; \"Thank you for calling Group Reservations\".\n-Agent provides a different name or alias. | No | Agent does not provide correct introduction, -Agent provides a different name or alias.\n1.3 | Must take ownership of the customers request, reiterating the customers issue. | 5 | #REF! | Yes | Agent provides ownership statement (I.E. \"I'll be more than happy to assist you with..\"), echoing back the reason of the call. | 3.1 | Acknowledge Guests request, reiterating guests needs. | 5 | Yes | Agent Provides a statement showing understanding of guests reason for calling. •Create a block of room \n•Make a reservation into an existing block of rooms \n•Book an individual reservation (1-8 rooms) \n•Attempt to book a same day check-in or extended stay\nNo | Agent does not provide FULL ownership statement. | No | Agent does not display understandin of guests request.\n2.2 | Must confirm an provide all relevant information to the owner of the reservation (first and last name, itinerary number, hotel name and booking dates, etc.) before triggering any process. | 10 | #REF! | Yes | -Agent confirms enough pieces of information to make sure the correct service is being provided and the process is being done over the correct booking. Even if the information is being provided by a third party.\n-The agent provides enough information to avoid misunderstandings regarding the total cost of the reservation | Must document all relevat information correctly making sure that each piece of information is placed in the correct location on the request form. Not avoiding any part of the request form, including \"Travel Agent\" information if guest says they are a TA. | 20 | Yes | Agent captures all request information, and inserts it into the correct location | Put in closing Agent must recap all essential details during the call, either throughout the process of the call or at the end of the call to confirm accuracy. | Part#2> Worth20pts. Agent requets, and confirms (using phonetic alphabet where necessary), information for all fields on Group Request form. | Part#2> Worth20pts. Agent does not confirm all relevant information, using the phonetic alphabet where necessary, or does not capture the correction needed for the information to be accurate\nNo | -Agent confirms less data than needed.\n-The agent does not confirm and omits information required to start the reservation process.\n-Set false expectations with partial or incorrect information when confirming the reservation.\n-Agent does not probe or confirm (first and last name, itinerary number, hotel name and booking dates, etc.) | 4.1 | No | Agent enters incomplete information and/or inserts it into the wrong location on the request form. Agent avoids entering information for a TA.\nN/A | The booking can't be found as it was not made through HotelPlanner. | N/A | Guest did not require group RFP (Request For Proposal)\nAgent represents HotelPlanner and its partner in a honest manner. If guest inquires agents' location or company, agent is to answer guest with designated verbage. (Page 7 on Training manual.) | 20 | Yes | Agent answers guest question with correct verbiage from page 7 of training manual, or honest answer. (ie…\"What I’m able to do for you is provide the best group rates for the hotels in this city and these group rates will be sent to you via email”)\nNo | Agent Provides incorrect information pertaining to the request and/or the service we provide. Agent falsely represents information of the hotel and area details, location of agent. Agent provides hotel phone number, process of getting the phone number, or address for guest to contact hotel.\nN/A | Guest did not require group RFP (Request For Proposal)\n5.1 | Ownership; Controling the call and guiding the guest throughout the call. | 15 | Yes | Agent displays ownership throughout the call, by asking leading questions and completing the RFP.\nNo | Displaying uncertain behaviors with a show of lack of confidence.\nDid the agent demostrate expertise in the process? | 16 | #REF! | 6.1 | TELEPHONE TECHNIQUES: | 15 | Yes | Agent must be professional throughout the conversation, active listening for key information, not speaking over guest, avoiding jargon/slang/abbreviations; clear rate of speech, clear accent, proper use of vocabulary. To avoid dead air.\n3.1 | Must display active listening and allow customer to speak without interruption. | 10 | #REF! | Yes | -Agent fully listened to the customer's request.\n-Agent allows customer to speak without interruption. | No | Agent doesn't understand what guest is saying Agent blames phone connection for misunderstanding caller Agent asks irrelevant questions Agent engages in unnecessary \"small-talk\"\nN/A | Always applies. | 7.1 | Following Process and Closing Call | 15 | Yes | Agent must recap all essential details during the call, either throughout the process of the call or at the end of the call to confirm accuracy. Agent must provide the following information to the guest prior to ending the call: * Email will be sent to guest in the next 15 minutes fr. Assigned Planner, with HotelPlanner login information *Recommend giving the hotels at least 24 hours to respond, as these rates are coming directly from the on site Sales Managers *Agent provided request ID# and password *Assisted caller to retrieve password if they already have a group account. *Agent offers further assistance to guest, give a \"thank you for calling\", allowing the guest to disconnect first.\n3.2 | Must notify the customer of the hold times and dead air. | 6 | #REF! | Yes | -Agent notifies the customer about the hold or dead air times.\n-Agent keeps the customer informed about the progress of their request; thanking their patience for their waiting time when returning from the hold/dead air. | No | Process not followed correctly\nAssessment Total Score | 100 | 0 | PASS? | PASSING SCORE IS =/> 80\n8.1 | New critical Errors:\n8.2 | Agent submits incorrect email address."}
{"id": "currency-reservation.pptx::chunk1", "source_rel": "currency-reservation.pptx", "type": "pptx", "text": "[Slide 1]\nCurrency\nTo change the Currency type for the Guest when Booking a reservation, in the top right-hand corner click on the Currency Icon.\nNext select which Continent and Country for the Currency you would need. This will quote the price of the reservation in that currency. Also, when the reservation is booked it will show what currency the reservation is made."}
{"id": "disconnected-calls-call-backs.pptx::chunk1", "source_rel": "disconnected-calls-call-backs.pptx", "type": "pptx", "text": "[Slide 1]\nGuidelines on calling customers back who got disconnected within the call.\nWe should make 1 attempt only to call the customer back if the customer gets disconnected or the call gets disconnected while trying to contact the hotel.\n-Click on DND if the call gets disconnected to call the customer back\n- Initiate the call right after the call gets disconnected\n- Use Make a Call to do the callback.\nAlways Document in Agents Notes the details of the callback whether you were able to call the customer back or not.\nSelect the appropriate dropdown for the call and make sure all relevant information are in the notes.\nCustomer Call Back Guidelines"}
{"id": "documenting-notes-new-version.pptx::chunk1", "source_rel": "documenting-notes-new-version.pptx", "type": "pptx", "text": "[Slide 1]\nDocumentation and Notes\nDocumentation and Notes are required to know what has been discussed during a call with a Guest and it must have:\nSelect from the dropdown Reason for the call and notate the guests request in the notes.\nName of the Guest or Caller (If is not the Guest on the RSV as well their role or relation towards them)\nActions Taken when necessary.\nFinal Resolution and outcome.\nName of the FD Representative (When applicable)\nClick Add Note when completed.\nYour Notes goes here!\nExample of proper Documentation.\nIF IT’S NOT ON THE NOTES IT DIDN’T HAPPEN!"}
{"id": "drop-down-menu-fit-notes-updated.docx::chunk1", "source_rel": "drop-down-menu-fit-notes-updated.docx", "type": "docx", "text": ""}
{"id": "drop-down-menu-fit-notes-updated.docx::chunk2", "source_rel": "drop-down-menu-fit-notes-updated.docx", "type": "docx", "text": "FIT Notes Drop-down Choices Explained\nRoom Not Found Upon Check In – hotel does not have the reservation in their system; hotel is SOLD OUT and cannot accommodate guest; reserved room type is not available\nCustomer Booked Wrong Hotel – self-booked, guest made error in booking (dates/location/occupancy/names/number of rooms/room type, etc.)\nOur Agent Booked Wrong Hotel – sales agent made error in booking (dates/location/occupancy/names/number of rooms/room type, etc.)\nClient Requesting to Cancel – guest notifies us that they wish to cancel the booking (please include the reason for cancellation and, if necessary, contact hotel for FOC approval)\nHotel Approved Partial Refund Verbally – hotel informed agent that there WILL BE a penalty charged for cancellation\nHotel Approved Partial Refund in Writing – email received from hotel indicating a penalty WILL BE charged for cancellation\nHotel Approved Full Refund Verbally – FOC received from hotel by agent (must include name/position/cancellation number or $0 folio)\nHotel Approved Full Refund in Writing – hotel notified us by email that booking is canceled FOC\nHotel Denied Refund – hotel employee denied refund (must include name/position of employee)\nSupplier Approved Refund – agent receives approval from Rate Provider via phone or email request (if not full refund, specify amount being refunded to HotelPlanner)\nSupplier Denied Refund – Rate Provider declines refund request (specify reason if given by supplier)\nCheck out Early/Late – guest calls to request a change of dates (cancel/rebook opportunity)\nNeeds to Cancel and Rebook – guest requests modification to booking that cannot be done on HP platform\nCredit Card Issue – guest informs us of any issue regarding their credit card (Virtual Card issues, misuse, double-billing, identity theft, etc.)\nRefund Missing – any refund request that needs to be reviewed (missing refund, partial refund requesting full, Protecht..etc…). If it has been more than 10 days since email was sent to New Refund by Ticket team please also send a slack message to the General Channel. (Follow the escalation matrix)\nClient Called to Confirm – guest calls to confirm their booking; hotel should be contacted; if reservation not found, send immediately to Slack for Channel Manager to contact Rate Provider\nOccupancy Concern – wrong number of adults/children listed on original booking (especially necessary for all-inclusive resorts and Europe/Asia bookings)\nHotel Quality Concern – issues involving hotel amenities, cleanliness, safety, hotel service, etc.\nDisputed – guest has filed a DISPUTE with their credit card company (amount disputed will show on FIT)\nRequested Folio via Email -agent requested folio from hotel (send to reservations@hotelplanner.com )\nReceipt Needed – guest requests an itemized receipt to be sent to them\nFraud – guest claims their credit card was charged for a reservation they did not make or know about\nDouble Charged – guest was charged more than one time for a booking (request screenshot of posted charges from credit card provider)\nName Change – guest needs to change the primary guest’s name on the reservation and hotel is unable to make the modification. Guest may need to cancel and rebook if rate provider unable to assist.\nDeclined Voucher / Requested Refund – guest received a voucher macro or a voucher has already been issued and guest declines the voucher, opting for a credit card refund.\nPrice Review – guest is questioning charge higher than expected or finding lower price elsewhere."}
{"id": "global-privileges-training-slide.pptx::chunk1", "source_rel": "global-privileges-training-slide.pptx", "type": "pptx", "text": ""}
{"id": "global-privileges-training-slide.pptx::chunk2", "source_rel": "global-privileges-training-slide.pptx", "type": "pptx", "text": "[Slide 1]\nGlobal Privileges Travel Club\nGlobal Privileges is HotelPlanner’s first travel club and bundle product designed to grow repeat business.\nBenefits include discounted rates, no complex rules to follow, and no points to earn. The savings are immediate and on 1.4 million properties worldwide.\nMembers receive our exclusive DealWire newsletter every other week with travel inspiration and timely advice throughout the year.\nWe give months away (1 month, 2 months) as a perk for certain room types. You will see these included months listed on the client’s confirmation. We do not charge for the complimentary months so please assure the guest there are no charges.\nClients will receive an email with the option to upgrade their experience to a paid membership, but they will have that option once they receive the invitation (via email).\nMembership is $49.99/month or $500.00/year. Cancel at any time for any reason.\nSupport Calls requesting to cancel their membership or to advise they have not received their membership perk gifts then please provide the client with our VIP Service email. VIP@Globalprivileges.com\nZendesk tickets regarding membership benefits or membership gifts should be forwarded to VIP@GlobalPrivileges.com via side conversations.\nImportantly, members will receive our very best VIP ‘white glove’ customer service and support to modify their reservations at any time for any reason based on obtaining hotel waivers and approvals (standard procedures).\nWhen receiving a call from Global Privilege members, agents should offer immediate resolution to the customer and notify the channel managers via Slack for additional support. Do not disconnect the call until the requested service is completed to the customers’ satisfaction or until it is handed off to your manager."}
{"id": "global-privileges-training-slide.pptx::chunk3", "source_rel": "global-privileges-training-slide.pptx", "type": "pptx", "text": "[Slide 2]\nGlobal Privileges Travel Club\n\n[Slide 3]\nGlobal Privileges Travel Club\n\n[Slide 4]\nGlobal Privileges Travel Club\nBelow are some examples of offers given in the client’s confirmation page:"}
{"id": "group-flights.pptx::chunk1", "source_rel": "group-flights.pptx", "type": "pptx", "text": "[Slide 1]\nGroup Flights\nIf a Guest calls in requesting Group Flights (10+ passengers or more):\nAssist guest with Group Block request first on the HotelPlanner platform.\nYou’ll ﬁnd the Group Flights link on the right side of your Softphones platform.\nYou can let our Guest know:\n“If you go to hotelplanner.com/GroupFlight there you can submit a request for group ﬂight quotes online.”\nIf the Guests ask for further assistance creating the Request, you can click on the Link and complete the form for the guest.\nValidate the Email Address and Guest Full Name using the NATO Phonetic Alphabet."}
{"id": "groups-and-extended-stays-jan-2.pptx::chunk1", "source_rel": "groups-and-extended-stays-jan-2.pptx", "type": "pptx", "text": "[Slide 1]\nIntroduction to Group Requests and Extended Stay Requests\nThis process is where we complete an RFP (Request for Proposal) to our hotel partners requesting discounted group rates or lower nightly rates depending on the guest’s length of stay.\nThe form is completed for both types of requests in a similar fashion by asking the guest a few simple questions and gathering their contact information and email address to view these quotes.\nThe guest will have a dedicated point of contact (assigned planner) that is an expert in the hotel market for that region. They are also eligible for a voucher , should they choose to book through us and utilize one of our hotel options. If the caller is a travel agent, they may be eligible for a commission in lieu of a voucher.\nThe overall process is to assist the client with obtaining the best available rates from the hotels that meet their needs by using rate-checking technology.\n\n[Slide 2]\nGroup Requests\nA Group Request is when a guest is requesting quotes for discounted pricing for 9+ rooms. This can be made for one specific hotel or multiple hotels in their desired destination for a specified group event.\nThese discounted quotes are sent to the guest via their email account when the Group Request is completed. The guest will be able to create future requests should they need to under their Account Settings."}
{"id": "groups-and-extended-stays-jan-2.pptx::chunk2", "source_rel": "groups-and-extended-stays-jan-2.pptx", "type": "pptx", "text": "[Slide 3]\nHow does a Group Request work?\nGroup Requests can be submitted for 9+ Rooms\n(Exceptions being New York City or Las Vegas, which require 10+ rooms for a group rate)\nIf a Guest is looking for less than 9 rooms, 5 - 8 rooms, increase the number to 9 rooms on the form to get the request to go through. This will allow the guest to receive group rates and provide access to our individual rates should they not want to sign a contract with the hotel. Anything less than 5 rooms, the guest is welcome to book on the Individual Sales Platform. As an agent you can assist them with this new hotel reservation.\nOnce the Request has been submitted, the platform will notify the chosen Hotel/Hotels of the request. The Hotels will then provide the lowest available group rate to the guests via email. Allow the hotels up to 24-48 hours to reply with their rates.\nOnce the request has been submitted the guest will receive an email in next 15 minutes. The guest can login to their request to view the quotes from the hotel/hotels using their email address and the password we will have provided to them.\nThe guest can choose any available rate by selecting “Contact Hotel”, this will provide the guest with the direct contact information of the Hotel Sales Manager to finalize the details of the Group Block.\nOnce the Group Block is finalized the group coordinator (normally the person calling about the group request) can send the hotel info to the guests to finalize and pay for their room or in some cases the coordinator will pay for the rooms. This all depends on the hotel options.\nGroup Request\nQuotes"}
{"id": "groups-and-extended-stays-jan-2.pptx::chunk3", "source_rel": "groups-and-extended-stays-jan-2.pptx", "type": "pptx", "text": "[Slide 4]\nExtended Stays\nWhat is an Extended Stay Request?\nAn Extended Stay Request is when a guest is needing a single room or multiple rooms, for an extended period of time, i.e. 14+ days. (examples are work crews, traveling medical professionals, college students…etc)\nException: Hotels.com and Priceline.com require 28 days or more to submit a request on their platform to get the discounted rates.\nBy completing the RFP (Request for Proposal) the same one that is used for the Group Requests , the guest will receive discounted rates from the hotel of their choice as well as other hotels located within that city.\nThe difference between a Group Request and an Extended Stay request are the Length of Stay and the number of rooms requested by the guest.\n\n[Slide 5]\nLOCATION\nCHECK-IN AND OUT DATES\nNUMBER OF ROOMS\nDO NOT SUGGEST TO A GUEST ANY OF THIS SET INFORMATION CAN BE MODIFIED ONCE SUBMITTED. If the guest needs to change any of these, they will have to submit a “New Request” in their account,. The guest can login and select “New Request”. DO NOT OFFER TO DO THIS UNDER A NEW EMAIL.\nImportant Details\nOnce a Request has been successfully submitted, there are important request details that cannot be modiﬁed, such as:"}
{"id": "groups-and-extended-stays-jan-2.pptx::chunk4", "source_rel": "groups-and-extended-stays-jan-2.pptx", "type": "pptx", "text": "[Slide 6]\nScripting\nMUST DO’s:\nGroup Calls / Extended Stays Ownership:\n“Yes, I can assist you with getting the lowest available rates for this Group Request (or) Extended Stay Request;\nwhat city and state can I assist you with?\"\nTake all the mandatory information of the Form:\nCity and State for Destination\nCheck-In and Out\n# of Rooms\nRoom Type\nGroup Type\nMeeting Space (Yes/No)\nAdditional Request\nEmail\nPhone Number\nFull Name.\nVerify the Email Address and Guest Full Name using NATO Phonetic Alphabet.\nA full recap of the information must be completed.\nExplain how the process will work for the Guests:\n“Your request has been submitted. You will be receiving an email within the next 15-30 minutes. Once you receive this email from your assigned planner, you will be able to login and view the available group rates. Your login is your email address that you just provided, and the password is (PROVIDE THE PASSWORD). Also your Request ID is (PROVIDE THE REQUEST ID)\nI do recommend giving the hotels at least 24 hours to respond, as these rates will be coming directly from the on site Sales Managers. Feel free to select any of the bids provided to you. Once accepted you will have the name, number and email for that local Sales Manager should you have any questions or would like to go ahead and set up your block.\nDo you have any further questions? Thank you for calling and have a wonderful day. “"}
{"id": "groups-and-extended-stays-jan-2.pptx::chunk5", "source_rel": "groups-and-extended-stays-jan-2.pptx", "type": "pptx", "text": "[Slide 7]\nOvercoming Objections\nWhen a guest asks if they are speaking with the hotel directly, we can reply with the following examples to overcome the possible objection:\n\"What I’m able to do for you is provide the best group rates for the hotels in this city and these group rates will be sent to you via email”\n\"This is a free service with no obligation. We can save you time by providing discounted rates from your preferred hotel, in addition to other hotels in that area. “\n\"This is where you can see pricing for different properties and once you make a decision on which hotel best ﬁts your group, you will be able to conﬁrm all the ﬁner details with the hotel of your choice.\"\n\n[Slide 8]\nExtended Stays\nSelect the HotelPlanner :: English option of the Drop-Down menu to be able to complete the RFP (Request for Proposal)\nSame Day or within 24 hours of check-In, agents can do the following:\nBecause hotels can take 24-48 hours to respond to the RFP, offer to book the guest for immediate check-in through the individual platform ; while submitting the request for 4 days later.\nIf the request is for multiple rooms , we can book the rooms immediately through the individual platform for 8 or less rooms at a time. If more than 10 rooms place the guest on a brief hold and call the hotel to verify the availability."}
{"id": "groups-and-extended-stays-jan-2.pptx::chunk6", "source_rel": "groups-and-extended-stays-jan-2.pptx", "type": "pptx", "text": "[Slide 9]\nBooking in a Block\nWhat to do if a guest wants to book within an existing block of rooms:\nAssist by offering to book the room as an individual reservation at the current rate that is available for their preferred hotel.\nIf the guest objects to the current rate, and would like to stay with the group block, advise the guest to contact the group coordinator to obtain the booking instructions for their group block (we do not have access to these blocked rates). These instructions may be in the communications received from the coordinator about the group block.\nIf guest is unaware of who the group coordinator is, mention that the coordinator is the person in their group that set up the block for them. This information may be in an email they received that notified them of the group block for the event, or it may be on an event page for their group.\n\n[Slide 10]\nGroup Promo Vouchers\nEligible group bookings are sent a voucher after the stay. These are sent to the group coordinator, and this is done in order to:\nThank the customer for booking their group request thru HotelPlanner.\nEnsure that the group coordinator submits a copy of their receipt to HotelPlanner in order for us to collect our commission from the hotel."}
{"id": "hp-tickets-qa-10-31-2023.xlsx::chunk1", "source_rel": "hp-tickets-qa-10-31-2023.xlsx", "type": "xlsx", "text": ""}
{"id": "hp-tickets-qa-10-31-2023.xlsx::chunk2", "source_rel": "hp-tickets-qa-10-31-2023.xlsx", "type": "xlsx", "text": "[Sheet: Sheet1]\nHP Client form | Updated 11/1/2023\nHotel Planner | Service Assessment | # | % | Criteria | Guideline | Hotel Planner | Ticket Assesment | Poss Score | Actual Score | Criteria | Guideline\nDid the agent demostrate expertise in the process? | 3 | #VALUE! | Agent met service level agreement (SLA) for first interaction with assigned ticket | 5 | Yes | Agent worked ticket within 24 hours of assignment\nYes | -Agent fully listened to the customer's request.\n-Agent allows customer to speak without interruption. | No | Agent failed to work ticket within 24 hours of assignment\n1.1 | Must be available and ready to take incoming call. | 3 | #VALUE! | Yes | Agent must answer the call immediately avoiding that the guest has to speak first. | The agent understood the guest's concern(s) | 20 | Yes | Agent clearly understood guest's concern(s); asked follow-up questions wwhen necessary\nNo | Guest speaks first, either greeting or making a request. | No | No- if agent does not understand the guest's concern\n2.2 | Must confirm an provide all relevant information to the owner of the reservation (first and last name, itinerary number, hotel name and booking dates, etc.) before triggering any process. | 10 | #VALUE! | Yes | -Agent confirms enough pieces of information to make sure the correct service is being provided and the process is being done over the correct booking. Even if the information is being provided by a third party.\n-The agent provides enough information to avoid misunderstandings regarding the total cost of the reservation | Agent offered most appropriate solution to respond to the guest's concern(s). Provided alternatives to solution where necessary. | 10 | Yes | The Agent researches the concern and provides the best solution possible based on the guidelines while achieving exceptional customer service. If alternatives are necessary than The agents provides those to The guest\nNo | -Agent confirms less data than needed.\n-The agent does not confirm and omits information required to start the reservation process.\n-Set false expectations with partial or incorrect information when confirming the reservation.\n-Agent does not probe or confirm (first and last name, itinerary number, hotel name and booking dates, etc.) | No | The agent does not research the issue and/or provides a solution that is not feasible to address the concern. The agent does not provide alternatives when necessary.\nN/A | The booking can't be found as it was not made through HotelPlanner.\nN/A | Always applies. | Ticket Processes: contact Hotel and/or Rate Provider by phone and/or Side Conversation | 10 | Yes | Agent contacted the Hotel and/or Rate provider when necessary via phone and or Side Conversations.\n3.2 | Must notify the customer of the hold times and dead air. | 6 | #VALUE! | Yes | -Agent notifies the customer about the hold or dead air times.\n-Agent keeps the customer informed about the progress of their request; thanking their patience for their waiting time when returning from the hold/dead air. | No | Agent failed to contact the hotel and/or rate provider\nNo | -Agent placed the customer on hold without a notification, or keeps a long dead silence without informing the guest about the progress.\n-Agent does not thank for the waiting time.\n-Agent uses unnecessary silence gaps or excessive holds. | N/A | Not applicable\nN/A | Hold or waiting times where not used. | Ticket Processes: sent Side Conversation to NewRewfunds or Vouchers where applicable | 10 | Yes | Agent emailed the necessary internal departments in order to finalize the solution provided to the guest\n3.3 | Must explore and find all solutions/alternatives for guest's needs and issues. | 10 | #VALUE! | Yes | Agent takes control of the guests problem to guarantee the best solution by offering alternatives for the issue/request expressed; using phrases as \"It is a pleasure to help you with your vacations\", \"I am pleased to support you\", etc. and showing a good will to find a solution on the request. | No | Agent did not email the necessary internal departments in order to finalize the solution provided to the guest.\nN/A | Not applicable\nYes | Agent correctly opens the call by saying \"Thank you for calling Hotel Reservations\", using the same name or english alias in all calls. I.E. Ricardo = Richard | Ticket Processes: used correct, approved macro and/or proper grammar when communicating with guest | 10 | Yes | Agent provided a response to the guest using approved correct macro and/or proper grammer and spelling when communicating to the guest.\nNo | -Agent does not provide correct introduction; \"Thank you for calling Group Reservations\".\n-Agent provides a different name or alias. | No | Agent provides a response that is not an approved macro and/or uses improper grammer or spelling when communicating to the guest.\nN/A | Always applies.\nN/A | Always applies. | Ticket Escalations When Applicable (Slack, TicketReview) | 10 | Yes | Agent follows the escalation matrix when applicable\n3.4 | Must sound positive, professional and enthusiastic throughout the call (tone); avoiding jargon/slang. | 10 | #VALUE! | Yes | -Agent spoke in a pleasant, polite, enthusiastic and professional tone of voice, avoiding jargon/slang throughout the entire call.\n-Agent maintained a adequate pace for the customer.\n-Agent sounds confident throughout the entire call\n-Agent avoids mumbling or reading notes aloud | No | Agent does not follow the escalation matrix when applicable\nN/A | Not applicable\nN/A | Always applies | Must properly document Internal Note. Use only approved abbreviations and complete sentences. Include information regarding any Side Conversation in your Internal Note. | 20 | Yes | Agent makes an internal note on the ticket they worked as to what occurred/actions taken to resolve or update the ticket.\n4.2 | Must properly document notes. | 16 | #VALUE! | Yes | Agent takes correct and complete notes with all necessary information about guest's request and interaction. \nIndicating guests reason for the call and summarize steps taken and information provided. | No | Agent fails to make an internal note on the ticket they worked as to what occurred/actions taken to resolve or update the ticket.\nNo | Agent doesn't take notes or takes incomplete notes.\n1.2 | Must open the call with correct introduction. | 2 | #VALUE! | Yes | Agent correctly opens the call by saying \"Thank you for calling Hotel Reservations\", using the same name or english alias in all calls. I.E. Ricardo = Richard | Selected correct Status for Ticket (Open, Pending, Solved) | 5 | Yes | Agent select the correct status when updating the ticket.\nNo | -Agent does not provide correct introduction; \"Thank you for calling Group Reservations\".\n-Agent provides a different name or alias. | No | Agent fails to update the status or chooses the incorrect status when updating the ticket.\nN/A | Always applies.\nNo | -Agent doesn't provide statement of assistance or thanks the customer for the call.\n-Agent hangs up the call. | SCORING | 100 | 0 | PASSING SCORE =/> 90%\nN/A | Call was ended abruptly (bad connection, system issue) or disconnected by the customer"}
{"id": "introduction-new-v.pptx::chunk1", "source_rel": "introduction-new-v.pptx", "type": "pptx", "text": "[Slide 2]\nWhat is\nHotelPlanner is a leading travel technology company and hotel booking engine that combines proprietary artiﬁcial intelligence and a remote reservations and customer service network.\nThis technology ensures the lowest rates by allowing customers to receive quotes online directly from hotel group sales managers as well as getting access to all rates sources in the industry.\n\n[Slide 3]\nFounded in 2003, HotelPlanner has enduring partnerships with the world’s largest online travel agencies, well-known hotel chains, individual hotels, online wedding providers, ancillary lodging providers, corporations, professional and youth sports teams, and franchises, universities, and government agencies.\nWhat is\n\n[Slide 4]\nGlossary\nCONCEPT | DESCRIPTION\nITINERARY NUMBER | It refers to the number of the reservation in HP system.\nHOTEL/MOTEL | A building where people stay, usually for a short time, paying for their rooms and meals.\nRATE | Price per night of the room without taxes.\nVIRTUAL CARD | Used by provider to pay the hotel\nVOUCHER | Virtual card meant to be used on HP System\nSHUTTLE | Transportation included by the hotel\nCONTINENTAL & HOT BREAKFAST | Hot & cold breakfast\nHOTEL RATING | Number of stars that the hotel has.\nAMENITIES | Services/Facilities offered by the hotel"}
{"id": "introduction-new-v.pptx::chunk2", "source_rel": "introduction-new-v.pptx", "type": "pptx", "text": "[Slide 5]\nGlossary\nCONCEPT | DESCRIPTION\nRATE PROVIDER | Also known as \"Supplier\" is the entity that sells the rate to us.\nFRONT DESK (FD) | Is the reception area of the hotel, is the staff that checks guests in and assigns them a room.\nROLLAWAY BED | Extra beds that have wheels.\nSURCHARGE | Extra charge payable at FD\nNEW REFUND | Reference to the \"NewRefund\" e-mail.\nFITNESS FACILITIES/CENTER | GYM\nCANCELATION # | The number given when a reservation is cancelled.\nFREE OF CHARGES | Type of cancellation.\nGENERAL MANAGER | Has the authority to approve refunds beyond a regular FD agent.\nRESERVATION | blocking or booking a particular room type for a guest, for a definite period of time.\n\n[Slide 6]\nReservation Flow\nG\nGUESTS\nHOTEL PLANNER\nHP\nRATE PROVIDER\nRP\nHOTELS\nH\n\n[Slide 7]\nType of Reservations\nPrepaid:\nThis type of reservation gets charged at the time the reservation is made.\n✔ CC is needed or voucher.\nPaid at Hotel:\nThis type of reservation is charged at the time the guest checks in unless otherwise stated by the hotel in the cancellation policy. The service fee is charged at the time the reservation is made.\n✔ CC is needed.\n\n[Slide 8]\nService Fee\nService Fees are charged at the time of Booking.\nThey are charged on Pay at Hotel Reservations.\nService Fees are refundable ONLY upon Guest request.\nWE DO NOT OFFER PROACTIVELY THE REFUND FOR THE SERVICE FEES"}
{"id": "introduction-new-v.pptx::chunk3", "source_rel": "introduction-new-v.pptx", "type": "pptx", "text": "[Slide 9]\nDiscounts\nAAA/AARP: American Automobile Association / American Association of Retired People.\nMilitary/Government: Should be booked as Pay at Hotel.\nSenior Discounts: Guests older than 65 years old.\nIn order to have the discounts to show up, you must select the discount type.\n\n[Slide 10]\nLogin: Agents.HotelPlanner.com\nForgot Password feature is disabled, please do not click on it.\n\n[Slide 11]\nMaking a Reservation (8 Rooms or Less)\n\n[Slide 12]\nChoosing Hotel Properties\n\n[Slide 13]\nChoosing Hotel (continued)\n\n[Slide 14]\nSelecting # of Guests and Room Type\n\n[Slide 15]\nProperty Amenities\n\n[Slide 16]\nProperty Policies\n\n[Slide 17]\nNon-Included Fees\n\n[Slide 18]\nGuest Details\nWARNING\nAlways make sure to update the Email Address information with the one provided by the Guest. Not doing so, could end up creating a Reservation with your Corporate Email Address and this is a potential FRAUD.\n\n[Slide 19]\nBilling Details\nTips\nAlways make sure to copy the correct Billing Address in order to complete the Booking. Any possible mistake here could cause an error that won’t allow you to complete the Booking. You’ll have the auto-complete option for this part.\n\n[Slide 20]\nReservation Confirmation\n\n[Slide 21]\nInbound Softphone\n\n[Slide 22]\nAnswering a Call\n\n[Slide 23]\nReservation Pop-Up\n\n[Slide 24]\nFind Booking"}
{"id": "introduction-new-v.pptx::chunk4", "source_rel": "introduction-new-v.pptx", "type": "pptx", "text": "[Slide 25]\nReservation Look Up\nDetails Notes View\nGuest Info\nReservation Total\nVirtual Card Info\nProperty Info\nDate of Purchase\nAgent Who Booked Check-In (If the RSV was made and Out by the Guest online it Dates\nwould be Blank)\nRP Info\nItinerary Number (It always starts with the letter H)\n\n[Slide 26]\nReservation Look Up\nWhen Guests does not have their Itinerary Number, you could ﬁnd their RSV looking with their Full Name or Email Address. For this, we should change the First Date Filter to the previous year and then adding the information provided by the Guests.\n\n[Slide 27]\nOutbound Softphone\nONLY FOR HOTEL CALLS\n\n[Slide 28]\nReading a Reservation\nUse this VIEW link to access de information of the RSV itself.\nUse this DETAILS/NOTES link to check the status of what have been happening with a particular RSV and also to add your notes.\n\n[Slide 29]\nThank You!"}
{"id": "meeting-space.pptx::chunk1", "source_rel": "meeting-space.pptx", "type": "pptx", "text": "[Slide 1]\nMeeting Space Only\nIf a Guest is only interested in booking a Meeting Space and NOT any Hotel Rooms we can let them know that:\nMeeting Space Only requests can be made via a link which we provide verbally to the guest. Go to Meetings.com and there you will be able to book online just the Meeting Space that you need."}
{"id": "modifications-of-rsvs-final-july.pptx::chunk1", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 1]\nWhen NOT to OPEN a Ticket:\nMODIFICATIONS OF RESERVATIONS\nMISSING ITINERARY OR REQUESTING A RECEIPT\nWhen to OPEN a Ticket:\nOriginal Confirmation was sent, but the Guest needs a revised receipt because of a change, or a refund has been processed on the RSV\nGuest needs us to add their Company Name for expense purposes\nGuest needs an Itemized Receipt by day, and the booking is a Prepaid RSV\nGuest has complained about Taxes and Fees or is asking for a breakdown of the \"Tax Recovery & Fees\" open this as a Price Review Ticket\nGuest simply asks for a copy of their Receipt but with no other specifications use the \"Email it\" feature. Be sure to confirm the spelling of the guest's email\nGuest is asking for a receipt, and the booking is \"Pay at Hotel\", call the hotel and ask for the receipt to be emailed to the client"}
{"id": "modifications-of-rsvs-final-july.pptx::chunk2", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 2]\nMODIFICATIONS OF RESERVATIONS\nADDING A NIGHT\nAdding a Night to a Reservation is NOT to be confused with Reducing “Length of Stay”. Guests needing to add days Before Check-In or add days After Check-Out at the same Hotel as their existing reservation. This is done by creating a New Reservation for only the additional nights in a Brand-New Transaction. Access the Hotel inventory by clicking on the FIT Hotel Name and searching for the dates Guests wishes to add.\nVerify exact Room Type on the existing Reservation and match to the additional Reservation if possible.\nIn the rare case there are no rooms available at that location please open a new browser and check directly on https://www.hotelplanner.com/ or offer an alternative hotel for the additional nights.\nContinue by clicking on “Book Now” and advise Guests of the total price of the new reservation and cancellation policy by reading the Mandatory Recap.\nProvide Guests with their additional Itinerary Number and advise they will receive a copy via their Email and SMS.\nAdvise Guests we’ll be placing them on a brief hold to Confirm the Reservations and contact the Hotel asking them to keep the Guest in the same room for their entire stay.\nFinally, come back to the Guest and provide details of the confirmation and offer assistance for any future bookings."}
{"id": "modifications-of-rsvs-final-july.pptx::chunk3", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 3]\nFor a Name Change, whether for Pay at Hotel or Prepaid Reservations we MUST call the Hotel for assistance in ADDING a name to the reservation:\nIf Hotel Accepts advise Guests the request has been completed. Offer assistance for any future bookings. Finally, using the dropdown Client Called to Confirm and Resolved with Explanation in the Notes.\nIf Hotel Declines or Needs to Wait for a GM Approval and they’re unable to add it on their end, raise a Ticket for Needs to Modify Reservation and include the detailed information in your Notes. If this change is made on the Same Day of the Check-In refer to the Escalation Matrix and ask on the Slack General Channel for immediate support and resolution.\nOn rare occasions the “Modify Ticket Agents” may need to Cancel and Rebook with appropriate name.\nMODIFICATIONS OF RESERVATIONS\nNAME CHANGE"}
{"id": "modifications-of-rsvs-final-july.pptx::chunk4", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 4]\nMODIFICATIONS OF RESERVATIONS\nBED / ROOM TYPE CHANGE\nPay at Hotel\nFor Same Day/Next Day Check-In contact the Hotel to see if a change can be accommodated. Guests are responsible for Additional Charges upon arrival (Exception would be confirmation on Agent Error; for this we would advise Guests to send Receipt of the Additional Costs and Payment would be refunded via Check). If hotel denies the request, we will escalate to a supervisor to call and to the channel managers.\n•Offer to Cancel and Rebook via FIT Hotel Name\n•Check the availability of the desired Room Type, Price and Cancellation Policy.\n•Confirm the New Reservation first before cancelling the existing Reservation.\nIf Hotel is NOT able to complete Change + Penalty/ Non-Refundable:\nOffer to Cancel and Rebook via FIT Hotel Name\n•Call the Hotel for FOC.\n•Confirm the New Reservation first before cancelling the existing reservation\nIf Hotel is NOT able to complete Change + Free Cancellation:"}
{"id": "modifications-of-rsvs-final-july.pptx::chunk5", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 5]\nMODIFICATIONS OF RESERVATIONS\nBED / ROOM TYPE CHANGE\nPrepaid / Pay Now\nFor Same Day/Next Day Check-In contact the Hotel to see if a change can be accommodated. Guests are responsible for Additional Charges upon arrival (Exception would be confirmation on Agent Error; for this we would advise Guests to send Receipt of the Additional Costs and Payment would be refunded via the Original Charge). If hotel denies the request, we will escalate to supervisor to call and to the channel managers.\nFor future Check In’s ask the hotel if they can make the change and verify there are no charges. If the hotel declines or there is a fee to change open a Ticket under Needs to Modify Reservation and document in detail what needs to be changed in the Notes. The Ticket Agent will review to see if we will pay for the upgrade or request a Voucher to make the New Reservation. Follow all other Standards Procedures after New Reservation.\nException: If the Reservation was booked on the Same Day for future check-in and is Free Cancellation, then Cancel and Rebook the Reservation while on the phone with the guest."}
{"id": "modifications-of-rsvs-final-july.pptx::chunk6", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 6]\nMODIFICATIONS OF RESERVATIONS\nCHANGE IN OCCUPANCY\nPay at Hotel:\nContact the Hotel to check if a change can be accommodated. Guests are responsible for Additional Charges upon arrival (Exception would be confirmation on Agent Error; for this we would advise Guests to send Receipt of the Additional Costs and Payment via check would be sent to them within 30 days).\n•Offer to Cancel and Rebook via FIT Hotel Name (Typically only International Locations and Resorts).\n•Check the availability of the desired Room Type, Price and Cancellation Policy.\n•Confirm the New Reservation first before cancelling the existing Reservation.\nIf Hotel is NOT able to complete Change + Penalty/ Non-Refundable:\nOffer to Cancel and Rebook via FIT Hotel Name\n•Call the Hotel for FOC.\n•Confirm the New Reservation first before cancelling the existing reservation\nIf Hotel is NOT able to complete Change + Free Cancellation:\nKeep in mind: There are generally no additional fees for hotels within the USA. The exception is resorts, waterpark hotels, and all-inclusive properties"}
{"id": "modifications-of-rsvs-final-july.pptx::chunk7", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 7]\nMODIFICATIONS OF RESERVATIONS\nCHANGE IN OCCUPANCY\nPrepaid / Pay Now:\nFor Same Day Check-In contact the Hotel to see if a change can be accommodated. Guests are responsible for Additional Charges upon arrival (Exception would be confirmation on Agent Error; for this we would advise Guests to send Receipt of the Additional Costs and Payment would be refunded via the Original Charge).\nFor any changes greater than Same day Check-In (Typically only International Locations and Resorts) open a Ticket under Needs to Modify Reservation and document in detail what needs to be changed in the Notes. The Ticket Agent will request a Voucher to make the New Reservation. Follow all other Standards Procedures after New Reservation.\nException: If the Reservation was booked on the Same Day and is Free Cancellation, then Cancel and Rebook the Reservation.\nKeep in mind: There are generally no additional fees for hotels within the USA. The exception is resorts, waterpark hotels, and all-inclusive properties"}
{"id": "modifications-of-rsvs-final-july.pptx::chunk8", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 8]\nMODIFICATIONS OF RESERVATIONS\nCHANGE DATES - DIFFERENT DATES OR REMOVING NIGHTS\nPay at Hotel:\nContact the Hotel to check if a change can be accommodated. Guests are responsible for Additional Charges upon arrival (Exception would be confirmation on Agent Error; for this we would advise Guests to send Receipt of the Additional Costs and Payment via check would be sent to them within 30 days).\n•Offer to Cancel and Rebook via FIT Hotel Name\n•Check the availability of the desired Room Type, Price and Cancellation Policy.\n•Confirm the New Reservation first before cancelling the existing Reservation.\nIf Hotel is NOT able to complete Change + Penalty/ Non-Refundable:\nOffer to Cancel and Rebook via FIT Hotel Name\n•Call the Hotel for FOC.\nIf Hotel is NOT able to complete Change + Free Cancellation:\n\n[Slide 9]\nMODIFICATIONS OF RESERVATIONS\nPrepaid / Pay Now:\nFor any changes open a Ticket under Needs to Modify Reservation and document in detail what needs to be changed in the Notes. The Ticket Agent will request a Voucher to make the New Reservation. Follow all other Standards Procedures after New Reservation.\nException: If the Reservation was booked on the Same Day and is Free Cancellation, then Cancel and Rebook the Reservation.\nIf Same Day Check-In with Cancel and Rebook and you will need to call hotel for cancellation FOC, if approved open a ticket for the refund process. Rebook the guest immediately for the new dates.\nCHANGE DATES - DIFFERENT DATES OR REMOVING NIGHTS"}
{"id": "modifications-of-rsvs-final-july.pptx::chunk9", "source_rel": "modifications-of-rsvs-final-july.pptx", "type": "pptx", "text": "[Slide 10]\nMODIFICATIONS OF RESERVATIONS\nEARLY CHECK-OUT - IN-HOUSE & SHORTENING LENGHT OF STAY\nPay at Hotel:\nContact the Hotel for assistance in updating the Reservation.\nIf Hotel Declines or says Reservation was booked by an OTA or Needs to Wait for a GM Approval and they’re unable to change it on their end, select “Early Check-In/Out” from the Dropdown Menu.\nThen Set Proper Expectations with Guest letting them know:\n\n[Slide 11]\nMODIFICATIONS OF RESERVATIONS\nEARLY CHECK-OUT - IN-HOUSE & SHORTENING LENGHT OF STAY\nFor this scenario, please advise Guests to Check-Out at the Front Desk so they are aware they’re leaving ealier. Then, contact the Hotel for assistance in accommodating an Early Check-Out. Request Cancellation FOC for remaining Unused Nights from Hotel.\nPrepaid / Pay Now:\nIf Hotel Approves FOC select “Early Check-In/Out” from the Dropdown Menu, then advise Guest that any Refund will be subject for approval. Advise Guests if Refund is approved it will be 2-10 Business Days.\nIf Hotel Declines FOC set Proper Expectations with Guest hat the Reservation deemed Non-Refundable or with a Penalty. The guest is encouraged to speak to a manager on site at the hotel and provide us with the name of the manager that approved the change."}
{"id": "payment-ivr.pptx::chunk1", "source_rel": "payment-ivr.pptx", "type": "pptx", "text": "[Slide 1]\nPayment IVR\nThe payment IVR will be used by voice agents to capture payment details from the guest. This allows the guest to enter their credit card information without speaking it to the agent.\nThere are 3 different ways for the guest to enter their credit card information:\nType it into their phone\nReceive a Text Message to click on and Enter it.\nSay it.\nThe link below is the video used for training agents on how to use the Payment IVR.\nhttps://screenpal.com/u/wzZA/PaymentCapture"}
{"id": "phoentic-alphabets.pptx::chunk1", "source_rel": "phoentic-alphabets.pptx", "type": "pptx", "text": "[Slide 1]\nPhonetic Alphabet"}
{"id": "premium-support-team-type-of-note.pptx::chunk1", "source_rel": "premium-support-team-type-of-note.pptx", "type": "pptx", "text": "[Slide 1]\nAs a reminder, it is critically important to leave detailed and specific notes when assigning tickets to the Premium Support Team. Clearly outline the guest's support needs, any relevant context, and actions already taken.\nAdditionally, please make sure to reassure guests that our Escalation Agents will be addressing their concerns as soon as possible, with a target response window of within 24 hours.\nPremium Support Team\nHotelPlanner is introducing a new note type labeled \"Premium Support Team\" for reservations with a value exceeding $5,000. These high-value bookings will be managed by a Dedicated Scheduled Agents, who will ensure timely service.\nAs part of this elevated support process, guests will receive a follow-up—ideally within 24 hours—to address any questions or special requests related to their reservation.\nThis initiative is designed to enhance the experience for our customers and ensure white-glove service throughout their booking journey.\nThe type of note Premium Support Team in the Dropdown List in the Details/Notes.\nNew Premium Support Team Note Type – High-Value Reservation Assistance"}
{"id": "refund-protection-protecht-oct-2.pptx::chunk1", "source_rel": "refund-protection-protecht-oct-2.pptx", "type": "pptx", "text": "[Slide 1]\nRefund protection is handled via the company Protecht.\nIn the event guest would like to cancel their refund protection they purchased or submit for a refund request we would make the request in the HP platform. All refund requests require supporting documentation for the reason selected.\nRefund Protection\n\n[Slide 2]\nSubmitting a Protecht Protection Refund Request\nIf a guest is requesting a refund on a\nnon-refundable and they have protection,\nagents can submit a refund request\n(file a claim) via the confirmation email.\nAgents should enter the guest email address to start the refund request process.\nIt will email the guest the link to open a review for a refund of their hotel reservation total. In the event the guest did not receive email they can also contact Protecht customer service by emailing help@requestmyrefund.com\n\n[Slide 3]\nRemoving or Voiding the Refund Protection Plan\nIf a guest is asking for their refund protection\nto be removed or voided for a refund only of the\nRefund Protection cost to be processed, then\nplease use the “Remove Protection Plan”.\nIt will open a case for Protecht to review the\ncancellation and process a refund once approved.\nIf the guest is requesting to remove or void the Refund Protection and the link is not available, please open a ticket and share with the guest the contact information for Fan Shield.\nFor additional assistance with this charge Email help@requestmyrefund.com\n\n[Slide 4]\nRefund Protection Guide"}
{"id": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx::chunk1", "source_rel": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx", "type": "pptx", "text": "[Slide 1]\nLooking to improve the time of response to our Guests, HotelPlanner has now the Option to Create a Refund Request directly from the Details/Notes Section of a Reservation, instead of having to send the request through the New Refund Team for approval.\nThen system will ask for the Cancellation Reasons to be selected from a List of Options (depending on the reason) will be completing just a few more steps + our Notes and Refund Request will be submitted already.\nNEW REFUNDS TOOL\nIn the Details/Notes Section you will find the Create a Refund Button available for us to submit a Request of behalf of our Guests.\n\n[Slide 2]\nNEW REFUNDS TOOL\nClick on the Create a Refund button, system will show General Booking Information such as: Itinerary Number, Name of the Hotel, Check-In and Check-Out Dates, Total Amount of the Reservations and the Reservation’s Status. As well, we will be able to check if a Previous Refund Request has been submitted for this Reservation and if it has been queued or processed."}
{"id": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx::chunk2", "source_rel": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx", "type": "pptx", "text": "[Slide 3]\nNEW REFUNDS TOOL (Voice agents)\nPRICE MATCH / COMPENSATION\nThis options will be selected whenever Guests calls in with Complaints regarding the Price of their Reservations being too high, charges related to Taxes and Fees were too high or Hotel Quality Concerns. These calls will be reviewed by QA.\nSystem will show a Validation Question just to make sure one of these reasons has been mentioned by Guests and then will have a preferred 15% Option to be offer to them.\nIf Compensation is higher than the preferred 15% then we MUST select NO and fill in the Requested Refund Amount, finally Add our Notes and submit the Refund Request.\n\n[Slide 4]\nNEW REFUNDS TOOL(Ticket agents)\nThis options will be selected whenever Guests calls in and wants to Cancel their Reservation, system will look up for the Cancellation Policy and process their Refund -if possible- based in it.\nCANCELLATION REFUND BASED ON CANCELLATION POLICY\nIf Cancellation Policy is Non-Refundable, system will ask to select a different reason if Refund is necessary. Finally, ADD your Notes and submit the Refund Request."}
{"id": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx::chunk3", "source_rel": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx", "type": "pptx", "text": "[Slide 5]\nNEW REFUNDS TOOL (Ticket Agents)\nCUSTOMER SERVICE INITIATED REFUND\nThis options will be selected whenever Guests Requests has been previously escalated and is currently in Zendesk. On this, Guests might be asking for Partial Refunds.\nAs well, system will show a couple of Validation Question just to make sure one of these reasons has been mentioned by Guests.\nIn conclusion, system will populate the Amount to be Refunded for us to Add our Notes and submit the Refund Request.\n\n[Slide 6]\nNEW REFUNDS TOOL (Ticket Agents)\nBOOKING CHANGE THAT RESULTS IN COST DECREASE\nThis options will be selected for Modifications or whenever a Hotel or Supplier is unable to accommodate Guests and this results in a Rebook / Relocation that decreases the total cost of the Reservation\nSystem will show a Validation Question to check if Hotel / Supplier has approved the Refund and we must fill the Approved Refund Amount, i.e.: a one night or two nights Refund.\nIf Hotel / Supplier hasn’t approved the Refund the system will ask if a Manager has approved the Refund and as well, we’ll need to fill the Approved Refund Amount.\nIt is HIGHLY IMPORTANT that your Notes are as detailed as possible offering all the necessary information on the approval, i.e.: “GM from Hotel named John Doe approved the Refund as Guest checked-out early”."}
{"id": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx::chunk4", "source_rel": "refund-tool-for-voice-and-ticket-agents-august-2025.pptx", "type": "pptx", "text": "[Slide 7]\nNEW REFUNDS TOOL (Voice & Ticket)\nCREATE VOUCHER FOR REBOOKING\nCreate Voucher options will be selected whenever we needs an Immediate Voucher for as a Refund or to Rebook Guests.\nIt is HIGHLY IMPORTANT that your Notes are as detailed as possible offering all the necessary information on the approval, i.e.: “GM from Hotel named John Doe approved the Refund or Cancel FOC internally for rebooking"}
{"id": "refunds-and-cancellations-ticket-dec.pptx::chunk1", "source_rel": "refunds-and-cancellations-ticket-dec.pptx", "type": "pptx", "text": "[Slide 1]\nCANCELLATION REFUNDS\n\n[Slide 2]\nWhy do people cancel their reservation?\n•Change of Plans\n•Decide on a Different Location\n\n[Slide 3]\nREFUNDABLE / WITHIN CANCELLATION POLICY WITH PENALTY\n\n[Slide 4]\nREFUND/VOUCHER ON NON-REFUNDABLE\n\n[Slide 5]\nREOPEN TICKETS\n\n[Slide 6]\nREASONS TO CALL THE HOTEL ON CANCELLATIONS\nPay at the hotel\nIf reservation is cancellable but shows a penalty, we will call the hotel to obtain a waiver.\nIf reservation is non-refundable , we will call the hotel to obtain a waiver.\nIf reservation is covered by Stay-Shield and non-refundable, we will call the hotel to obtain a waiver. (DO NOT SHARE HOTEL APPROVAL/DENIAL WITH THE GUEST, PLACE DECISION IN THE NOTES)\nPRESS THE CANCEL BUTTON WHEN:\nAny open ticket where the guest has requested a refund.\n\n[Slide 7]\nWhat to obtain FROM the HOTEL?\n•If the hotel has agreed to a full refund on a penalized, non-refundable, or pay at hotel booking, ask for cancellation number, folio, hotel employee name and position.\n•If the hotel says they cannot provide a folio or that the folio is blank simply advise the hotel to send a typed email to Folio@hotelplanner.com\n•Please ask that email includes; Guest first and last name, and the message “this reservation was cancelled free of charge/ without penalty“."}
{"id": "relocation-and-vip.pptx::chunk1", "source_rel": "relocation-and-vip.pptx", "type": "pptx", "text": "[Slide 1]\nRelocations and VIP Tickets\nRELOCATIONS\nWhen a hotel has been oversold or the hotel can no longer honor the booking, they will notify HotelPlanner via a ticket in Zen Desk. These relocations requests are worked by HotelPlanner Management to find another hotel for these guests.\nVIP Tickets\nHotelPlanner has a dedicated VIP ticket type, that is used for special situations. These requests are worked by HotelPlanner Management to find a fast resolution to the guest."}
{"id": "sending-receipt.pptx::chunk1", "source_rel": "sending-receipt.pptx", "type": "pptx", "text": "[Slide 1]\nSending a Receipt\nWhen a guest asks for a receipt, take the following steps to send it to them:\n- Open the Itinerary or the Reservation and click on View\n- Confirm the Email Address we have on file\n- On the upper portion of the screen select the “Email It” button\n- Also “Text it” is available if the guest would prefer that option.\n- Advise the guest it could take up to 15 minutes to receive the email\n- If the guest required a more detailed receipt such as a breakdown of the taxes and fees then raise a ticket for escalation. Advise the guest the receipt will be provided via email."}
{"id": "slack.pptx::chunk1", "source_rel": "slack.pptx", "type": "pptx", "text": "[Slide 1]\nSlack is a tool for Work purposes ONLY! Keep it Professional.\n\n[Slide 2]\nMessaging through our General Channel should be only for:\nGuest unable to Check-In.\nReservation NOT found upon Check-In.\nVirtual Card payment errors.\nRefunds requested by email over 10 days ago.\nCancel / Rebook Opportunities.\nImmediate Voucher needed, while Guest is on the Line.\nGroup Requests where Planner cannot be reached.\nPrice Match."}
{"id": "soft-skills-cs.pptx::chunk1", "source_rel": "soft-skills-cs.pptx", "type": "pptx", "text": "[Slide 1]\nSoft Skills\nThey are your Personality Qualities that helps you Interact with others and ﬁnd the Best Solutions in any situation with your Personal Touch.\n\n[Slide 2]\nSoft Skills\nType of Soft Skills as needed:\nACTIVE LISTENING\nCOMMUNICATION\nEMPATHY\nUSE OF HOLD\nRAPPORT\nCONFIDENCE\nWhat we Heard\nWhat we Talk\nWhat we Feel\nWhat we Do\nWhat we Say\nWhat we Show\n\n[Slide 3]\nActive Listening\nParaphrase:\nUsed to show that you understand the reason of the call or the main concern.\nAsk Probing Questions:\nUsed to probe and clarify any doubts.\nFocus:\nVerbal aﬃrmations such as: “I see”, “Sure”, “Thank you”, or “I understand”.\nI will be more than happy to assist you with…\nI will look for a solution…\nI will do everything possible…\nI will gladly assist you with…\nI understand your needs…\nI know a possible solution for this…\nWhat we Hear: Pay attention to what your Guest tells you, repeat it back and apply Ownership and Empathy when necessary.\nRole Play Exercise:\nListen and repeat after me..."}
{"id": "soft-skills-cs.pptx::chunk2", "source_rel": "soft-skills-cs.pptx", "type": "pptx", "text": "[Slide 4]\nEmpathy\nWhat we Feel: Everytime a Guest is telling us that something is bothering them, they have a complaint or are going through a rough time.\nRole Play Exercise:\nLet’s check this Empathy Statements...\nI can see how Concerning this could be so allow me to…\nI cannot imagine how Frustrating you must feel so let me…\nI can see how Upsetting this inconvenience might be but I’m gonna…\nI am Deeply Sorry for this diﬃcult moment but let me…\nI can see you have spent a lot of time on this so allow me to…\nIf I were in your Position I’d feel the same way so I will…\n\n[Slide 5]\nBuilding Rapport\nPersonalize:\nCall the Guest by their Name.\nBe Optimistic:\nMake emphasis on the solution and not the problem.\nSearch Connection:\nMirror technique / Question generalities.\nListen:\nGet the maximum information.\nWhat we Say: Ask questions and listen to what your Guest has to say.\n\n[Slide 6]\nEffective Communication\nUso of Hold:\nCan you please allow me 2-4 minutes on Hold?\nRefresh the Call:\nMake your Guest aware of what you’re doing for them.\nTone of Voice:\nHow would you like to be treated as if you were the Guest.\nPronunciation:\nIs your Guest able to understand you quick at the ﬁrst time?\nProfessionalism:\nDo you talk to the Guest as if they were you friends?\nProduct Knowledge:\nDoes the Guest consider you trustworthy?\nHow do you know your communication is the best?"}
{"id": "soft-skills-cs.pptx::chunk3", "source_rel": "soft-skills-cs.pptx", "type": "pptx", "text": "[Slide 7]\nEffective Communication\nUSE OF TIME\nIf the Hold Time is used correctly it could be a great support.\nUse it wisely!\nREFRESH THE CALL\nYour Guests should always know what and how you’re helping them. Please refresh the call and tell them:\nThank you for waiting on the Line, I’m still talking with the FD…\nPlease allow me 2 more minutes, to complete submitting your request…\nThank you so much for your\npatience…\nYour Guest time is very important, so don’t leave them waiting on the Line for too long as they will have time to overthink their issue or concern.\n\n[Slide 8]\nEffective Communication\nPRONUNCIATION\nTONE OF VOICE\nIf you use the correct pronunciation and enunciation it will help you Guest hear and understand you clearly\nVocal interpretation and tone are your main tools, sounding close and welcoming will make thing easier for you\n… Y, as in Yankee.\n… E, as in Echo.\n… S, as in Sierra.\nAre you familiar with the Phonetic Alphabet?\n… Talk naturally as conﬁdence is key.\n… Don’t get defensive, don’t take anything personally.\n… Let you personality shine. Add your personal touch still maintaining your sense of professionalism.\n\n[Slide 9]\nPositive Language\nDeliver information in a pleasant and conﬁdent manner.\nWhenever possible, explore options for your Guest.\nBe sure to validate your Guest satisfaction.\nThe way you express yourself will affect whether your message was received positively or negatively.\nFocus on what you CAN DO, and not about what you CAN’T."}
{"id": "soft-skills-cs.pptx::chunk4", "source_rel": "soft-skills-cs.pptx", "type": "pptx", "text": "[Slide 10]\nPositive Language\nJust learn to say the same thing in a different way… How to do it? Let’s check\nDON’T SAY:\nI don’t know…\nWe can’t…\nYou can’t…\nNo\nPlease calm down…\nI didn’t know…\nThere’s nothing we can do…\nI’m not sure / I guess…\nDO SAY:\nThat’s a great question, allow me a moment to validate and…\nWhat I can do for you is…\nI apologize for the inconvenience…\nLet me check what options I have for you…\nI can understand how upsetting this is…\nThanks for bringing this to our attention…\nI’m sorry to hear about this…\nBased on what you described, the issue most likely…\n\n[Slide 11]\nThe Best Guest Experience\nFor Hotel Planner it is paramount to offer the best Guest Experience in front of their concerns. We can achieve that through: Ownership, Willingness to Help and Exploring Options.\nCare about their issues and concerns.\nOffer your best to assist them\nCheck what options can be helpful\nHappy Guests\nDON’T SAY NO!"}
{"id": "suppliers-requests-dec.pptx::chunk1", "source_rel": "suppliers-requests-dec.pptx", "type": "pptx", "text": "[Slide 1]\nSupplier Portal Requests\nSupplier portal requests are created when we need to receive a refund from certain suppliers. These are created for suppliers that have provided HP with a direct portal access to request a refund and are not created automatically via the Notes dropdown. Typically, requests are submitted on any customer service issue , below are a few examples:\nNon-refundable reservation\nA reservation with a penalty\nOther compensation\n\n[Slide 2]\nHow To Create a supplier request in Amadeus\nLogin to the following : https://servicehub.amadeus.com/public-all\n\n[Slide 3]\nUse the following information to login to the portal:\nOffice ID: PBI1S2400\nAgent Sign: Agrantham\nPassword: Whocantell6/1!\n\n[Slide 4]\nClick on Get Support to start the process\n\n[Slide 5]\nType in AVH\n\n[Slide 6]\nClick on Open a case\nSelect Amadeus Value Content from the drop down\n\n[Slide 7]\nOpen a case, please enter the below information\n\n[Slide 8]\nDepending on check in date\nType of Case select :\nPre departure if prior to guest checking in.\nOn the Road if guest is at the hotel\nPost departure if guest has checked out.\n\n[Slide 9]\nEnter the Description of the supplier request under Description\nEnter the supplier Itinerary Number under PNR\nEnter the Confirmation number under Hotel Confirmation #\n\n[Slide 10]\nEnter the Reservations@HotelPlanner.com email address under Alternate email address to notify and click Submit.\n\n[Slide 11]\nAdd Case number on ticket notes\nEnter the Case # into the Zen Desk Ticket"}
{"id": "suppliers-requests-dec.pptx::chunk2", "source_rel": "suppliers-requests-dec.pptx", "type": "pptx", "text": "[Slide 12]\nHow To Create a supplier request in FASTPAYHOTELS (FPH)\nClick on the link : https://agencies.fastpayhotels.com/service-desk\n\n[Slide 13]\nChoose Type of Issue from the drop down\nEnter the supplier Itinerary Number under Booking Reference\n\n[Slide 14]\nEnter Hotel Planner under Company Name\nEnter Reservations@HotelPlanner.com under email\nVerify the Check-in dates\n\n[Slide 15]\nEnter the Ticket Priority – submit as High\n\n[Slide 16]\nEnter Comments including the request and approval from the hotel\nUpload supporting documentation if available\n\n[Slide 17]\nEnter the Reference ID into the Zen Desk ticket\n\n[Slide 18]\nHow To Create a supplier request in SMYROOMS Click on the link : https://back.smyrooms.com/Enter the login information from the supplier contact spreadsheet\n\n[Slide 19]\nEnter the supplier itinerary number into the agency reference field and select search.\nSelect Create Task and Select Task to review cancellation fees\n\n[Slide 20]\nEnter your request under the Subject\nEnter all of the details under Indications and/or Notes\nUpload files if available and select Done\n\n[Slide 21]\nEnter the notes into Zen Desk"}
{"id": "ticket-escalation-matrix-2025-sept.xlsx::chunk1", "source_rel": "ticket-escalation-matrix-2025-sept.xlsx", "type": "xlsx", "text": "[Sheet: Sheet1]\nScenario/Concern​ | Slack​ | Refund Queue | Email to TicketReview​\nGuest cannot check-In - VC Declined/Reservation Not Found - RP is DerbySoft​ | Yes​ | No​ | No​\nGuest cannot check-In - VC Declined/Reservation Not Found - RP did not pick up​ | Yes​ | No​ | No​\nRefunds requested by email over 10 days ago​ | No​ | Yes​ | Yes​\nImmediate Voucher Needs (Rebooking)​ | No​ | Yes​ | No​\nCall Review Needed to Determine agent error, but call recording is not available on the system​ | No​ | No​ | Yes​\nCalling Hotel and Rate Provider - Expedia, Priceline, Webbeds (After 2 attemps by agent and not able to speak with anybody​ or resolve) | No​ | No​ | Yes​\nADA Accessibility room Issues​ | No​ | No​ | Yes​\nLegal Complaints - Government agencies or attorneys​ | No​ | No​ | Yes​\nThreats to Dispute or guest states they are disputing the charge​ but unable to obtain a refund from the hotel or provider | No​ | No​ | Yes​\nPrice Matching​ and Complaints regarding Tax Recovery & Fees | No​ | Yes​ | No​\nRequesting Receipt with tax breakdown | No​ | No​ | Yes​\nUnable to \"Create a Refund\" in the Refund Queue | Yes​ | No​ | No​\nRefunds or Vouchers to be processed once a ticket is solved (no longer using Vouchers@ or New Refund@ | No​ | Yes​ | No​\nTicket Requestor name is GET Support (Global Escalations Team for Expedia) | No​ | No​ | Yes​"}
{"id": "tickets-needing-price-review.pptx::chunk1", "source_rel": "tickets-needing-price-review.pptx", "type": "pptx", "text": "[Slide 1]\nWhen ticket agents are working tickets and the reason for the ticket is a price review agents now will escalate these to the refund department. They should do the following:\nCalculate the partial refund amount based on 20% of the Total Booking Amount and include the amount in the request to new refund.\nIndicate the Price Review reason for the refund request in the subject line of the email and send the request to newrefund@hotelplanner.com.\nAfter the email is sent to new refund, apply the Refund Processed macro and solve the ticket.\nBelow are some reasons for the Price Review:\nGuest is complaining about their taxes and/or fees.\nGuest is indicating that they have received a lower price directly from the hotel.\nTickets Needing Price Review\n\n[Slide 2]\nExample of Request:\nTickets Needing Price Review"}
{"id": "us-state-abbreviations.pptx::chunk1", "source_rel": "us-state-abbreviations.pptx", "type": "pptx", "text": "[Slide 1]\nUS State Abbreviations"}
{"id": "voice-escalation-matrix-2025-sept.xlsx::chunk1", "source_rel": "voice-escalation-matrix-2025-sept.xlsx", "type": "xlsx", "text": ""}
{"id": "voice-escalation-matrix-2025-sept.xlsx::chunk2", "source_rel": "voice-escalation-matrix-2025-sept.xlsx", "type": "xlsx", "text": "[Sheet: Sheet1]\nScenario/Concern​ | Slack​ | Create a Ticket | Refund Queue | Supervisor\nClient is unable to contact the agent assigned/planner for their Group Request and has an urgent request. | Yes​ | No​ | No​ | No​\nClient is unable to access their Group Block Account because their account is blocked. | Yes​ | No​ | No​ | No​\nGuest Cannot Check-In and RP is Derbysoft (slack notification is immediate) | Yes​ | Yes​ | No​ | Yes​\nGuest Cannot Check-In for same day reservation and RP is NOT Derbysoft. (slack notification is immediate) Supervisor to call Supplier to get room confirmed. | Yes​ | Yes​ | No​ | Yes​\nGuest Cannot Check-In for same day reservation and RP is NOT Derbysoft. No response from RP | Yes​ | Yes​ | No​ | Yes​\nSupervisor Call and Supervisor is available to take the call | No​ | Yes​ | No​ | Yes​\nSupervisor Call and Supervisor is not available to take the call | Yes​ | Yes​ | No​ | Yes​\nCompensation – Guest had a bad stay and would like compensation. Hotel denies compensation. Informed guest however they are insistent | No​ | Yes​ | Yes​ | No​\nModifications on a Refundable future stay - (Voucher Needed to Rebook while guest is on the phone) | No​ | No​ | Yes​ | No​\nModifications on a Non- refundable future stay - (Voucher Needed to Rebook while guest is on the phone) Need to get FOC from hotel - follow normal procedures on obtaining waivers. Zendesk Ticket should be opened for supplier waiver. | No​ | Yes​ | Yes​ | No​\nSame Day Relocation - Due to Hotel Conditions, Wrong Hotel, Hotel Fully Booked (Voucher Needed) Zendesk Ticket should be opened for supplier waiver. | No​ | Yes​ | Yes​ | No​\nCancellation – Refund/Voucher did not appear in FIT. (Same Day Relocation) Zendesk Ticket should be opened for supplier waiver. | No​ | No​ | Yes​ | No​\nCancellation – Partial Refund – Hotel approves full FOC - Internal FOC | No​ | Yes​ | Yes​ | No​\nCancellation – Only Manager can approve FOC and they are not available at this time | No​ | Yes​ | No​ | No​\nCancellation – Hotel approves FOC but they require an email to be sent to them first | No​ | Yes​ | No​ | No​\nSpecial Requests where the hotel cannot confirm at this time and advised agent to call back | No​ | Yes​ | No​ | No​\nRefund or Voucher requested by email over 10 days ago​ | No​ | No​ | Yes​ | No​"}
{"id": "voice-qa-form.xlsx::chunk1", "source_rel": "voice-qa-form.xlsx", "type": "xlsx", "text": ""}
{"id": "voice-qa-form.xlsx::chunk2", "source_rel": "voice-qa-form.xlsx", "type": "xlsx", "text": "[Sheet: Sheet1]\nHP Client form | As of 10/30/2023\nHotel Planner | Service Assessment | # | % | Criteria | Guideline | Hotel Planner | Voice Assesment | Poss Score | Actual Score | Criteria | Guideline\n1.1 | Must be available and ready to take incoming call. | 3 | #VALUE! | Yes | Agent must answer the call immediately avoiding that the guest has to speak first. | Agent is ready - and available - to receive call | 2 | Yes | Agent must answer within 3-5 seconds of notification\nNo | Guest speaks first, either greeting or making a request. | No | No- if agent took longer than 5 seconds to answer call\nN/A | System issues (hardware or software), as long as it is not a recurrent condition. | N/A | System issues (hardware or software); caller does not respond\n1.2 | Must open the call with correct introduction. | 2 | #VALUE! | Yes | Agent correctly opens the call by saying \"Thank you for calling Hotel Reservations\", using the same name or english alias in all calls. I.E. Ricardo = Richard | Must open the conversation with correct introduction. | 4 | Yes | Agent answers by saying \"Thank you for calling Hotel Reservations, My name is __________________, how may I assist you?\", using the same name or English alias in all calls. I.E. Ricardo = Richard\nNo | -Agent does not provide correct introduction; \"Thank you for calling Group Reservations\".\n-Agent provides a different name or alias. | No | Agent does not provide correct introduction, \"Thank you for calling Hotel Reservations\".\n-Agent provides a different name or alias.\nN/A | Always applies. | N/A | Always applies.\n1.3 | Must take ownership of the customers request, reiterating the customers issue. | 5 | #VALUE! | Yes | Agent provides ownership statement (I.E. \"I'll be more than happy to assist you with..\"), echoing back the reason of the call. | Acknowledge Guests request, reiterating guests needs. | 4 | Yes | Agent provides a statement showing understanding of guests reason for calling.\nNo | Agent does not provide FULL ownership statement. | No | Agent does not display understandin of guests request.\n2.2 | Must confirm an provide all relevant information to the owner of the reservation (first and last name, itinerary number, hotel name and booking dates, etc.) before triggering any process. | 10 | #VALUE! | Yes | -Agent confirms enough pieces of information to make sure the correct service is being provided and the process is being done over the correct booking. Even if the information is being provided by a third party.\n-The agent provides enough information to avoid misunderstandings regarding the total cost of the reservation | Must confirm and provide all relevant information to the caller. (first and last name, itinerary number, hotel name and booking dates.) before triggering any process. | 10 | Yes | Agent completes verification process.\nNo | -Agent confirms less data than needed.\n-The agent does not confirm and omits information required to start the reservation process.\n-Set false expectations with partial or incorrect information when confirming the reservation.\n-Agent does not probe or confirm (first and last name, itinerary number, hotel name and booking dates, etc.) | No | Agent does not complete verification process.\nN/A | The booking can't be found as it was not made through HotelPlanner. | N/A | The booking cannot be found or it was not made through HotelPlanner.\nN/A | Always applies. | Call Efficiency and Expectations | 10 | Yes | Agent set expectations of HOLD times prior to placing caller on HOLD. Responded with updates to caller if HOLD time was going to last longer than originally anticipated. Continued to update the caller and shared steps of the process with them (calling hotel, creating help ticket, escalating to management, etc.)\n3.2 | Must notify the customer of the hold times and dead air. | 6 | #VALUE! | Yes | -Agent notifies the customer about the hold or dead air times.\n-Agent keeps the customer informed about the progress of their request; thanking their patience for their waiting time when returning from the hold/dead air. | No | Exceeded timeframe set or failed to notify caller of processes to be used failed to call hotel as necessary Failed to request immediate supervisor assistance\nNo | -Agent placed the customer on hold without a notification, or keeps a long dead silence without informing the guest about the progress.\n-Agent does not thank for the waiting time.\n-Agent uses unnecessary silence gaps or excessive holds. | N/A | Caller was not placed on hold or caller ended call without waiting for additional steps to be taken\nN/A | Hold or waiting times where not used. | Must explore and find all solutions/alternatives for caller's needs and issues. Following processes and making decisions, showing ownership of the call. | 15 | Yes | Agent takes control of the caller's issue to guarantee the best solution by offering alternatives for the issue/request expressed; using phrases as \"It is my pleasure to help you with your hotel reservations.\" Thinking outside the box and working with caller to provide an equitable solution\n3.3 | Must explore and find all solutions/alternatives for guest's needs and issues. | 10 | #VALUE! | Yes | Agent takes control of the guests problem to guarantee the best solution by offering alternatives for the issue/request expressed; using phrases as \"It is a pleasure to help you with your vacations\", \"I am pleased to support you\", etc. and showing a good will to find a solution on the request. | No | Agent offers partial alternatives or information that doesn't solve the caller's request. Agent fails to follow HP protocol (ZenDesk, Slack, etc.) Agent provides MIS-information\nAgent proactively provides hotel information.\nN/A | Always applies. | TELEPHONE TECHNIQUES: Must be professional throughout the conversation avoiding jargon/slang/abbreviations | 15 | Yes | Used caller's name when addressing them. Only used \"ma'am\" or \"sir\" if confident of caller's gender. Spoke in clear, concise English and communicated well with caller. Clarified any confusing language, names, places, etc.\n3.4 | Must sound positive, professional and enthusiastic throughout the call (tone); avoiding jargon/slang. | 10 | #VALUE! | Yes | -Agent spoke in a pleasant, polite, enthusiastic and professional tone of voice, avoiding jargon/slang throughout the entire call.\n-Agent maintained a adequate pace for the customer.\n-Agent sounds confident throughout the entire call\n-Agent avoids mumbling or reading notes aloud | No | Used incorrect or unnecessary speech; Failed to speak clearly using a comfortable pace; Incorrectly identified caller's name or gender; Spoke over caller; Rudeness or profanity used\nN/A | Always applies | Must properly document notes. | 25 | Yes | Agent takes correct and complete notes with all necessary information about caller's request and interaction. \nIndicating caller's reason for the call and summarize steps taken and information provided. Updates FIT notes and creates ZenDesk ticket as required\n4.2 | Must properly document notes. | 16 | #VALUE! | Yes | Agent takes correct and complete notes with all necessary information about guest's request and interaction. \nIndicating guests reason for the call and summarize steps taken and information provided. | No | Agent doesn't take notes, takes incomplete notes, or fails to properly escalate caller's concern (Slack, ZenDesk, FIT, etc.)\nNo | Agent doesn't take notes or takes incomplete notes. | N/A | ONLY use N/A when reservation is not found or a NEW Reservation was Booked .\n5.- CLOSING | #REF! | Must recap the customer of all relevant information, and the possible outcomes of their request setting correct expectations. | 15 | Yes | Agent provided full recap of the nature of the call; reiterated to caller complete, clear and relevant information as to the outcome of their request/issue; clearly defined expectations; properly thanked caller for their call; waited for caller to disconnect before ending call\nDid the agent recap the information and confirm it to the guest? | 7 | #VALUE! | No | Agent does not indicate, guide, explain or provide the necessary information for the outcome of the customer's request. Agent ends call prior to agent disconnecting.\nAgent provides wrong/incomplete/unclear information and expectations.\n5.1 | Must recap the customer of all relevant information, and the possible outcomes of their request setting correct expectations. | 7 | #VALUE! | Yes | Agent gave the customer complete, clear and relevant information for the outcome of their request/issue; setting correct expectations. | N/A | Call was ended abruptly (bad connection, system issue) or disconnected by the customer\nNo | -Agent doesn't provide statement of assistance or thanks the customer for the call.\n-Agent hangs up the call. | SCORING | 100 | 0 | PASSING SCORE =/> 80%\nN/A | Call was ended abruptly (bad connection, system issue) or disconnected by the customer"}
{"id": "vouchers-2025-sept.pptx::chunk1", "source_rel": "vouchers-2025-sept.pptx", "type": "pptx", "text": "[Slide 1]\nVouchers\nWhen Guest cancels with or without penalty and they want to rebook without paying again.\nWhen Hotel approved a cancellation with or without penalty for a Non-Refundable RSV.\nVouchers can be generated by having them submitted to the refund queue. Agents will have to request the voucher to rebook the guest.\nVouchers contain a 16-digit number (similar to a credit card number) and a 6-digit PIN\nImmediate voucher requests should be sent through Slack “General” channel. (Same-day re-booking)\nVoucher will be valid for 120 days from the date of issuance.\nVouchers can only be used for Pay Now type of RSVs.\nIf the reservation amount is > than the amount of the voucher, guests will be able to pay the difference on the check-out page.\nIf the unused voucher amount is > $50 USD , a new voucher for the difference will be automatically sent to the email address on file.\nA voucher is HotelPlanner credit, used to apply funds toward a new reservation made on our platform.\n\n[Slide 2]\nVouchers\nThe Voucher is used as a gesture of good will for issues occurring generally beyond our control.\nAlways offer Voucher as a ﬁrst option, over Refund to CC.\nGuest redeeming their own voucher can be used in: voucher.hotelplanner.com . Agents would book a guest using the voucher on the platform in their agent view."}
{"id": "vouchers-2025-sept.pptx::chunk2", "source_rel": "vouchers-2025-sept.pptx", "type": "pptx", "text": "[Slide 3]\nVouchers\nClick “+ Use A Voucher” to add voucher information on payment screen\nIf there is a balance showing after voucher amount is deducted from total price, agent must manually add the guest’s credit card information\nIf there is more than $50 USD remaining on the voucher – after the sale is completed – a NEW voucher will be issued automatically and sent to the guest’s email."}
{"id": "zen-desk-training-guide-dec.pptx::chunk1", "source_rel": "zen-desk-training-guide-dec.pptx", "type": "pptx", "text": "[Slide 1]\nZENDESK BASICS\n\n[Slide 2]\nGARDEN ELEMENTS\nHotelPlanner.Zendesk.com\nLOGIN\n\n[Slide 3]\nHOME\nAll Notifications, Updates, Comments and recent replies are shown on DASHBOARD.\nTickets Statistics.\nAll your unsolved tickets.\n\n[Slide 4]\nVIEW\nReopen\nYour Unsolved Tickets\nUnassigned Tickets\nService\nAll Unsolved Tickets\n\n[Slide 5]\nSEARCH\n\n[Slide 6]\nTHINGS TO CHECK\nASSIGNEE\nTAGS\nEMAIL ADDRESS\nTICKET CONCERN\nFIT\nITINERARY NUMBER\nDETAILS AND NOTES\nINTERNAL NOTES\n\n[Slide 7]\nFILTERS\n\n[Slide 8]\nSTATUS\nASSIGNEE\n\n[Slide 9]\nUNSOLVED/PENDING TICKETS ASSIGNED TO YOU\n\n[Slide 11]\nClick on your Playlist button to open your tickets\n\n[Slide 12]\nPlaylist will open and will display your Tickets in the order received. This functionality allows you to go thru your queue in a more streamlined manner. Submitting a status on the current ticket will automatically move you to the next ticket in your queue. Using the next available ticket or skip features will allow you to move to the next ticket without updating a status on the current ticket. along the right hand side you can merge the current ticket with any possible tickets with the same itinerary.\n\n[Slide 13]\nOPEN\n•\nTICKET\nSTATUS\nPENDING\nSOLVED\nNEW TICKET. FIRST TOUCH\nCURRENTLY WORKING ON TICKET OR TICKET NEEDS FURTHER STEPS TO ACCOMPLISH\nABLE TO ACCOMPLISH ALL NEEDED STEPS. NO FURTHER ACTION NEEDED"}
{"id": "zen-desk-training-guide-dec.pptx::chunk2", "source_rel": "zen-desk-training-guide-dec.pptx", "type": "pptx", "text": "[Slide 14]\nASSIGN\n•\nGOOD TO\nKNOW (Only when working on tickets outside of their assigned tickets)\nTAKE IT\nMERGING\nTO HAVE IT ASSIGNED TO SOMEONE ELSE EXAMPLE NEED ASSISTANCE FROM SUPPORT\nTO PUT TICKET UNDER YOUR NAME\nCOMBINE TICKETS WITH THE SAME CONCERN AND ITINERARY\n\n[Slide 15]\nASSIGN\n\n[Slide 16]\nASSIGN\n\n[Slide 17]\nTAKE IT\nCHANGE STATUS\n\n[Slide 18]\nSUBMIT AS PENDING\n\n[Slide 19]\nWORKING THE TICKET\n\n[Slide 20]\nTICKET STATUS\n\n[Slide 21]\nITINERARY NUMBER\n\n[Slide 22]\nGUEST CONCERN\n\n[Slide 23]\nTAGS\n\n[Slide 24]\nMULTIPLE TICKETS\n\n[Slide 25]\nINTERNAL NOTE\nCREATION\n\n[Slide 26]\nINTERNAL NOTES\nEXISTING\n\n[Slide 27]\nHOW DO WE CONTACT OR RESPOND TO ANYONE?\n\n[Slide 28]\nPUBLIC REPLY\n\n[Slide 29]\nMACRO\n•\nACCEPTABLE RESPONSES\nTEMPLATE RESPONSE CREATED BY HP TEAM FOUND IN ZENDESK\n\n[Slide 30]\nMACRO\nCONTACT THE GUEST\n\n[Slide 31]\nMACRO\nCONTACT THE GUEST\n\n[Slide 32]\nNEW SIDE CONVERSATIONS\nCONTACT THE HOTEL/RP/HP INTERNAL\n\n[Slide 33]\nNEW SIDE CONVERSATIONS\nCONTACT THE HOTEL/RP/HP INTERNAL\n\n[Slide 34]\nEXISTING SIDE\nCONVERSATION\n\n[Slide 35]\n“DO NOT TOUCH”\nTICKETS\nLUCID TRAVEL\nBOOK IN BLOCK\nVIP – vipres@hotelplanner.com"}
